In [2]:
# Importing libraries
import os
import pandas as pd
import numpy as np

In [3]:
# Importing interim data
interim_data = pd.read_csv('../data/interim/interim.csv')
interim_data.head()

   mileage_per_year  model_year      price sold  car_age
0             21801        2000   30941.02  yes       24
1              7843        1998   40557.96  yes       26
2              7109        2006   89627.50   no       18
3             26823        2015   95276.14   no        9
4              7935        2014  117384.68  yes       10

In [4]:
# Organizing dataframe columns
interim_data = interim_data[[col for col in interim_data.columns if col != ['sold']]+ ['sold']]
interim_data.head()

   mileage_per_year  model_year      price sold  car_age sold
0             21801        2000   30941.02  yes       24  yes
1              7843        1998   40557.96  yes       26  yes
2              7109        2006   89627.50   no       18   no
3             26823        2015   95276.14   no        9   no
4              7935        2014  117384.68  yes       10  yes